<<<<<<< Updated upstream
﻿// Создание кода T4 для модели "C:\Users\koval\OneDrive\Рабочий стол\Singletone\WpfApp1\Model1.edmx" включено. 
=======
﻿// Создание кода T4 для модели "C:\Users\koval\OneDrive\Рабочий стол\PROEKT2\WpfApp1\Model1.edmx" включено. 
>>>>>>> Stashed changes
// Чтобы включить формирование кода прежних версий, измените значение свойства "Стратегия создания кода" конструктора
// на "Legacy ObjectContext". Это свойство доступно в окне "Свойства", если модель
// открыта в конструкторе.

// Если не сформированы контекст и классы сущности, возможная причина в том, что вы создали пустую модель, но
// еще не выбрали версию Entity Framework для использования. Чтобы сформировать класс контекста и классы сущностей
// для своей модели, откройте модель в конструкторе, щелкните правой кнопкой область конструктора и
// выберите "Обновить модель из базы данных", "Сформировать базу данных из модели" или "Добавить элемент формирования
// кода...".